"""
Дан текст. Выведите все слова, встречающиеся в тексте, по одному на каждую строку. Слова должны быть отсортированы по
убыванию их количества появления в тексте, а при одинаковой частоте появления — в лексикографическом порядке. Указание.
После того, как вы создадите словарь всех слов, вам захочется отсортировать его по частоте встречаемости слова.
Желаемого можно добиться, если создать список, элементами которого будут кортежи из двух элементов: частота
встречаемости слова и само слово. Например, [(2, 'hi'), (1, 'what'), (3, 'is')]. Тогда стандартная сортировка будет
сортировать список кортежей, при этом кортежи сравниваются по первому элементу, а если они равны — то по второму.
Это почти то, что требуется в задаче.

Формат ввода
Вводится текст.

Формат вывода
Выведите ответ на задачу.
"""


def realization():
    f = open("input.txt", "r")
    result = {}

    for line in f:
        words = line.split()

        for word in words:
            result[word] = result.get(word, 0) + 1

    list_result = [(value, key) for key, value in result.items()]
    list_result.sort(key=lambda x: (-x[0], x[1]))
    for value in list_result:
        print(f'{value[1]}')


if __name__ == '__main__':
    realization()
